<?php

namespace App\Arrays;

class Travel
{
    public static $case = [
        'search' => [
            1 => 'Ищу',
            2 => 'Ищу',
            3 => 'Ищем',
            4 => 'Ищу',
        ],
        'child'  => [
            1 => 'Еду',
            2 => 'Еду',
            3 => 'Едем',
            4 => 'Еду',
        ],
    ];

    public static $is_children = [
        0 => 'без детей',
        1 => 'с детьми',
    ];

    public static $payment = [
        1 => 'Каждый платит за себя',
        2 => 'Заплачу за всех',
        3 => 'Денег нет, здоровья вам и хорошего настроения',
    ];

    public static $moth = [
        1  => 'Январь',
        2  => 'Февраль',
        3  => 'Март',
        4  => 'Апрель',
        5  => 'Май',
        6  => 'Июнь',
        7  => 'Июль',
        8  => 'Август',
        9  => 'Сентябрь',
        10 => 'Октябрь',
        11 => 'Ноябрь',
        12 => 'Декабрь',
    ];

    public static $transport = [
        1 => 'Пешком',
        2 => 'Автостопом',
        3 => 'На велосипеде',
        4 => 'На мотоцикле',
        5 => 'На машине',
        6 => 'На автобусе',
        7 => 'На поезде',
        8 => 'На самолете',
        9 => 'На пароходе',
    ];
}
