<section class="main-page-head-section">
    <div class="sw-table-cell sw-w-50 pr-10 border-right">
        <img src="/img/18++.jpg" width="400" height="136" alt="18+">
        <p>
            Внимание.<br>
            Сайт содержит материалы для взрослых.<br>
            Если вам нет 18 лет, если тематика сайта противоречит вашим моральным или религиозным принципам,
            то немедленно покиньте сайт.
        </p>
    </div>
    <div class="sw-table-cell sw-w-50 pl-10">
        <dl>
            <dt>Знакомства с семейными парами</dt>
            <dd>Взаимосогласованный обмен сексуальными партнерами между сложившимися семейными парами</dd>
        </dl>
        <dl>
            <dt>Реальные пользователи</dt>
            <dd>Реал-статус гарантирует реальность пользователей</dd>
        </dl>
        <dl>
            <dt>Бесплатные сервисы</dt>
            <dd>Регистрация, поиск, общение, знакомство, подарки</dd>
        </dl>
        <dl>
            <dt>Анонимность</dt>
            <dd>Гибкие настройки уровня доступа</dd>
        </dl>
    </div>
</section>